<a href="https://colab.research.google.com/github/NithishXplorer/SQL/blob/main/DDL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
%load_ext sql
%sql mysql+pymysql://root:root@127.0.0.1/test

In [ ]:
'''

Data Definition Language (DDL) commands allow me to define and manage a schema in SQL. I
In a nutshell, a schema in SQL is a blueprint that defines how data is organized in a database and
how the relationships among different tables within the database are managed.

DDL COMMANDS :

1) Create   : Create a table and its columns together with their datatype.
2) Alter    : Modify column names and add or delete a column.
3) Rename   : Change the name of the table.
4) Comment  : Add an explanation to the SQL code for other team members to review.
5) Truncate : Remove data from a table without deleting the table.
6) Drop     : Delete the table with its data.

'''

'\n\nData Definition Language (DDL) commands allow me to define and manage a schema in SQL. I\nIn a nutshell, a schema in SQL is a blueprint that defines how data is organized in a database and \nhow the relationships among different tables within the database are managed.\n\nDDL COMMANDS :\n\n1) Create   : Create a table and its columns together with their datatype.\n2) Alter    : Modify column names and add or delete a column.\n3) Rename   : Change the name of the table.\n4) Comment  : Add an explanation to the SQL code for other team members to review.\n5) Truncate : Remove data from a table without deleting the table.\n6) Drop     : Delete the table with its data.\n\n'

In [ ]:
%%sql

show databases;

 * mysql+pymysql://root:***@127.0.0.1/test
8 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sql_practice',),
 ('sys',),
 ('test',),
 ('world',)]

In [ ]:
%%sql

use test;

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [ ]:
%%sql

show tables;

 * mysql+pymysql://root:***@127.0.0.1/test
5 rows affected.

[('best_student',),
 ('not_null',),
 ('student',),
 ('student_constraint',),
 ('sub_student',)]

In [ ]:
%%sql

# create
create table movie
(
    m_id int primary key,
    name varchar(30),
    budget decimal(10,3),
    director varchar(30),
    actor varchar(30),
    actress varchar(30)
);

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [ ]:
%%sql

desc movie;

 * mysql+pymysql://root:***@127.0.0.1/test
6 rows affected.

[('m_id', 'int', 'NO', 'PRI', None, ''),
 ('name', 'varchar(30)', 'YES', '', None, ''),
 ('budget', 'decimal(10,3)', 'YES', '', None, ''),
 ('director', 'varchar(30)', 'YES', '', None, ''),
 ('actor', 'varchar(30)', 'YES', '', None, ''),
 ('actress', 'varchar(30)', 'YES', '', None, '')]

In [ ]:
%%sql

INSERT INTO movie (m_id, name, budget, director, actor, actress) VALUES
(1, 'Vikram', 120.500, 'Lokesh Kanagaraj', 'Kamal Haasan', 'Gayathrie'),
(2, 'Master', 135.000, 'Lokesh Kanagaraj', 'Vijay', 'Malavika Mohanan'),
(3, 'Kaithi', 50.000, 'Lokesh Kanagaraj', 'Karthi', 'None'),
(4, 'Jailer', 200.000, 'Nelson Dilipkumar', 'Rajinikanth', 'Ramya Krishnan'),
(5, 'Mersal', 120.000, 'Atlee', 'Vijay', 'Samantha'),
(6, 'Bigil', 180.000, 'Atlee', 'Vijay', 'Nayanthara'),
(7, 'Asuran', 45.000, 'Vetrimaaran', 'Dhanush', 'Manju Warrier'),
(8, 'Soorarai Pottru', 60.000, 'Sudha Kongara', 'Suriya', 'Aparna Balamurali'),
(9, 'Theri', 100.000, 'Atlee', 'Vijay', 'Samantha'),
(10, '96', 20.000, 'C. Prem Kumar', 'Vijay Sethupathi', 'Trisha');

 * mysql+pymysql://root:***@127.0.0.1/test
10 rows affected.

[]

In [ ]:
%%sql

select * from movie;

 * mysql+pymysql://root:***@127.0.0.1/test
10 rows affected.

[(1, 'Vikram', Decimal('120.500'), 'Lokesh Kanagaraj', 'Kamal Haasan', 'Gayathrie'),
 (2, 'Master', Decimal('135.000'), 'Lokesh Kanagaraj', 'Vijay', 'Malavika Mohanan'),
 (3, 'Kaithi', Decimal('50.000'), 'Lokesh Kanagaraj', 'Karthi', 'None'),
 (4, 'Jailer', Decimal('200.000'), 'Nelson Dilipkumar', 'Rajinikanth', 'Ramya Krishnan'),
 (5, 'Mersal', Decimal('120.000'), 'Atlee', 'Vijay', 'Samantha'),
 (6, 'Bigil', Decimal('180.000'), 'Atlee', 'Vijay', 'Nayanthara'),
 (7, 'Asuran', Decimal('45.000'), 'Vetrimaaran', 'Dhanush', 'Manju Warrier'),
 (8, 'Soorarai Pottru', Decimal('60.000'), 'Sudha Kongara', 'Suriya', 'Aparna Balamurali'),
 (9, 'Theri', Decimal('100.000'), 'Atlee', 'Vijay', 'Samantha'),
 (10, '96', Decimal('20.000'), 'C. Prem Kumar', 'Vijay Sethupathi', 'Trisha')]

In [ ]:
%%sql

/*

Alter :
        -> Adding new columns in a table
        -> Renaming columns in a table
        -> Modifying columns in a table
        -> Dropping columns in a table
*/

# Adding new columns

Alter table movie
add column box_office decimal(10,3);

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [ ]:
%%sql

desc movie;

 * mysql+pymysql://root:***@127.0.0.1/test
7 rows affected.

[('m_id', 'int', 'NO', 'PRI', None, ''),
 ('name', 'varchar(30)', 'YES', '', None, ''),
 ('budget', 'decimal(10,3)', 'YES', '', None, ''),
 ('director', 'varchar(30)', 'YES', '', None, ''),
 ('actor', 'varchar(30)', 'YES', '', None, ''),
 ('actress', 'varchar(30)', 'YES', '', None, ''),
 ('box_office', 'decimal(10,3)', 'YES', '', None, '')]

In [ ]:
%%sql

# Rename a column name

alter table movie
rename column box_office to box_office_collection

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [ ]:
%%sql

desc movie;

 * mysql+pymysql://root:***@127.0.0.1/test
7 rows affected.

[('m_id', 'int', 'NO', 'PRI', None, ''),
 ('name', 'varchar(30)', 'YES', '', None, ''),
 ('budget', 'decimal(10,3)', 'YES', '', None, ''),
 ('director', 'varchar(30)', 'YES', '', None, ''),
 ('actor', 'varchar(30)', 'YES', '', None, ''),
 ('actress', 'varchar(30)', 'YES', '', None, ''),
 ('box_office_collection', 'decimal(10,3)', 'YES', '', None, '')]

In [ ]:
%%sql

# Modifying columns in a table

alter table movie
modify column actor varchar(50);

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [ ]:
%%sql

desc movie;

 * mysql+pymysql://root:***@127.0.0.1/test
7 rows affected.

[('m_id', 'int', 'NO', 'PRI', None, ''),
 ('name', 'varchar(30)', 'YES', '', None, ''),
 ('budget', 'decimal(10,3)', 'YES', '', None, ''),
 ('director', 'varchar(30)', 'YES', '', None, ''),
 ('actor', 'varchar(50)', 'YES', '', None, ''),
 ('actress', 'varchar(30)', 'YES', '', None, ''),
 ('box_office_collection', 'decimal(10,3)', 'YES', '', None, '')]

In [ ]:
%%sql

# Dropping columns in a table

alter table movie
drop box_office_collection;

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [ ]:
%%sql

desc movie;

 * mysql+pymysql://root:***@127.0.0.1/test
6 rows affected.

[('m_id', 'int', 'NO', 'PRI', None, ''),
 ('name', 'varchar(30)', 'YES', '', None, ''),
 ('budget', 'decimal(10,3)', 'YES', '', None, ''),
 ('director', 'varchar(30)', 'YES', '', None, ''),
 ('actor', 'varchar(50)', 'YES', '', None, ''),
 ('actress', 'varchar(30)', 'YES', '', None, '')]

In [ ]:
%%sql

# Rename table name

rename table movie to film;

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [ ]:
%%sql

show tables;

 * mysql+pymysql://root:***@127.0.0.1/test
6 rows affected.

[('best_student',),
 ('film',),
 ('not_null',),
 ('student',),
 ('student_constraint',),
 ('sub_student',)]

In [ ]:
%%sql

-- Comments:
-- Commenting in SQL is crucial for clarity and context, making your queries easier to understand and maintain.
-- It helps explain complex logic, document changes, and justify certain choices.

-- 1) Single-line comment: -- or #
-- 2) Multi-line comment: /* ... */

-- This is a single-line comment using "--"

# This is a single-line comment using "#"

-- Multi-line comments may cause issues in notebooks, so use -- lines instead when possible.

SHOW TABLES;

 * mysql+pymysql://root:***@127.0.0.1/test
6 rows affected.

[('best_student',),
 ('film',),
 ('not_null',),
 ('student',),
 ('student_constraint',),
 ('sub_student',)]

In [ ]:
%%sql

#truncate
-- Truncating a table is not the same as deleting it.
-- Truncating removes all the data but keeps the table's structure intact, while deleting removes the entire table, including its structure.

truncate table film;

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [ ]:
%%sql
desc film;

 * mysql+pymysql://root:***@127.0.0.1/test
6 rows affected.

[('m_id', 'int', 'NO', 'PRI', None, ''),
 ('name', 'varchar(30)', 'YES', '', None, ''),
 ('budget', 'decimal(10,3)', 'YES', '', None, ''),
 ('director', 'varchar(30)', 'YES', '', None, ''),
 ('actor', 'varchar(50)', 'YES', '', None, ''),
 ('actress', 'varchar(30)', 'YES', '', None, '')]

In [ ]:
%%sql
select * from film;

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [ ]:
%%sql

# Drop
drop table film;

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [ ]:
%%sql

desc film;

 * mysql+pymysql://root:***@127.0.0.1/test
(pymysql.err.ProgrammingError) (1146, "Table 'test.film' doesn't exist")
[SQL: desc film;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [ ]:
%%sql

show tables;

 * mysql+pymysql://root:***@127.0.0.1/test
5 rows affected.

[('best_student',),
 ('not_null',),
 ('student',),
 ('student_constraint',),
 ('sub_student',)]